Tekla Open API Reference for Tekla Structures 2025
ModelHandler.IsModelAutoSaved Method
Tells whether a model has auto saved information.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsModelAutoSaved(
	string ModelFolder
)
Public Function IsModelAutoSaved (
	ModelFolder As String
) As Boolean
Parameters
ModelFolder
Type: System.String
The model folder path to be used.
Return Value
Type: Boolean
True if there is auto saved information.
See Also
Reference
ModelHandler Class
Tekla.Structures.Model Namespace